%% ************************************************************************
%程序说明：
%   平滑滤波--NP点MT次滤波
%   input_y为被处理的数据
%   T为循环次数
%   output_y为最后滤波效果
%更新说明：
%   2015年6月 by materjay at XMU
%% ************************************************************************
%主要程序：
function output_y = SmoothingFiltering(input_y, NP, MT, T)
%读取数据长度
n=length(input_y);
%数据转移
a=input_y;
%按点数划分
switch NP
    %3点MT次平滑滤波
    case 3
        %按次数划分
        switch MT
            case 1
              for k=1: T
                 b(1) = (5*a(1) +2*a(2) -a(3)) /6;
                 for j=2:n-1
                   b(j) = (a(j-1) +a(j) +a(j+1)) /3;
                 end
                 b(n) = (-a(n-2) -2*a(n-1) +5*a(n)) /6;
                 a=b;
              end
            otherwise
                error('Input m Invalid.')
        end
    %5点MT次平滑滤波
    case 5
        %按次数划分
        switch MT
            case 1
              for k=1: T
                 b(1) = (3*a(1) +2*a(2) +a(3) -a(5)) /5;
                 b(2) = (4*a(1) +3*a(2) +2*a(3) +2*a(4)) /10;
                 for j=3:n-2
                   b(j) = (a(j-2) +a(j-1) +a(j) +a(j+1) +a(j+2)) /5;
                 end
                 b(n-1) = (a(n-3) +2*a(n-2) +3*a(n-1) +4*a(n)) /10;
                 b(n) = (-a(n-4) +a(n-2)+ 2*a(n-1) +3*a(n)) /5;
                 a=b;
              end
            case 2  
              for k=1: T
                 b(1) = (31*a(1) +9*a(2) -3*a(3) -5*a(4) +3*a(5)) /35;
                 b(2) = (9*a(1) +13*a(2) +12*a(3) +6*a(4) -5*a(5)) /35;
                 for j=3:n-2
                   b(j) = (-3*a(j-2) +12*a(j-1) +17*a(j) +12*a(j+1) -3*a(j+2)) /35;
                 end
                 b(n-1) = (-5*a(n-4) +6*a(n-3) +12*a(n-2) +13*a(n-1) +9*a(n)) /35;
                 b(n) = (3*a(n-4) -5*a(n-3) -3*a(n-2)+ 9*a(n-1) +31*a(n)) /35;
                 a=b;
              end                
            case 3   
              for k=1: T
                 b(1) = (69*a(1) +4*a(2) -6*a(3) +4*a(4) -a(5)) /70;
                 b(2) = (2* a(1) +27*a(2) +12*a(3) -8*a(4) +2*a(5)) /35;
                 for j=3:n-2
                   b(j) = (-3*a(j-2) +12*a(j-1) +17*a(j) +12*a(j+1) -3*a(j+2)) /35;
                 end
                 b(n-1) = (2*a(n-4) -8*a(n-3) +12*a(n-2) +27*a(n-1) +2*a(n)) /35;
                 b(n) = (-a(n-4) +4*a(n-3) -6*a(n-2) +4*a(n-1) +69*a(n)) /70;
                 a=b;
              end                
            otherwise
                error('Input m Invalid.')
        end    
        
    %7点MT次平滑滤波    
    case 7
        %按次数划分
        switch MT
            case 1
              for k=1: T
                 b(1) = (13*a(1) +10*a(2) +7*a(3) +4*a(4) +a(5) -2*a(6) -5*a(7)) /28;
                 b(2) = (5* a(1) +4*a(2) +3*a(3) +2*a(4) +a(5) -a(7)) /14;
                 b(3) = (7*a(1) +6*a(2) +5*a(3) +4*a(4) +3*a(5) +2*a(6) +a(7)) /28;     
                 for j=4:n-3
                   b(j) = (a(j-3) +a(j-2) +a(j-1) +a(j) +a(j+1) +a(j+2) +a(j+3)) /7;
                 end
                 b(n-2) = (a(n-6) +2*a(n-5) +3*a(n-4) +4*a(n-3) +5*a(n-2) +6*a(n-1) +7*a(n)) /28;    
                 b(n-1) = (-a(n-6) +a(n-4) +2*a(n-3) +3*a(n-2) +4*a(n-1) +5*a(n)) /14;
                 b(n) = (-5*a(n-6) -2*a(n-5) +a(n-4) +4*a(n-3) +7*a(n-2) +10*a(n-1) +13*a(n)) /28;
                 a=b;
              end
            case 2  
              for k=1: T
                 b(1) = (32*a(1) +15*a(2) +3*a(3) -4*a(4) -6*a(5) -3*a(6) +5*a(7)) /42;
                 b(2) = (5* a(1) +4*a(2) +3*a(3) +2*a(4) +a(5) -a(7)) /14;
                 b(3) = (a(1) +3*a(2) +4*a(3) +4*a(4) +3*a(5) +a(6) -2*a(7)) /14;     
                 for j=4:n-3
                   b(j) = (-2*a(j-3) +3*a(j-2) +6*a(j-1) +7*a(j) +6*a(j+1) +3*a(j+2) -2*a(j+3)) /21;
                 end
                 b(n-2) = (-2*a(n-6) +a(n-5) +3*a(n-4) +4*a(n-3) +4*a(n-2) +3*a(n-1) +a(n)) /14;    
                 b(n-1) = (-a(n-6) +a(n-4) +2*a(n-3) +3*a(n-2) +4*a(n-1) +5*a(n)) /14;
                 b(n) = (5*a(n-6) -3*a(n-5) -6*a(n-4) -4*a(n-3) +3*a(n-2) +15*a(n-1) +32*a(n)) /42;
                 a=b;
              end                
            case 3   
              for k=1: T
                 b(1) = (39*a(1) +8*a(2) -4*a(3) -4*a(4) +a(5) +4*a(6) -2*a(7)) /42;
                 b(2) = (8* a(1) +19*a(2) +16*a(3) +6*a(4) -4*a(5) -7*a(6) +4*a(7)) /42;
                 b(3) = (-4*a(1) +16*a(2) +19*a(3) +12*a(4) +2*a(5) -4*a(6) +a(7)) /42;     
                 for j=4:n-3
                   b(j) = (-2*a(j-3) +3*a(j-2) +6*a(j-1) +7*a(j) +6*a(j+1) +3*a(j+2) -2*a(j+3)) /21;
                 end
                 b(n-2) = (a(n-6) -4*a(n-5) +2*a(n-4) +12*a(n-3) +19*a(n-2) +16*a(n-1) -4*a(n)) /42;    
                 b(n-1) = (4*a(n-6) -7*a(n-5)-4*a(n-4) +6*a(n-3) +16*a(n-2) +19*a(n-1) +8*a(n)) /42;
                 b(n) = (-2*a(n-6) +4*a(n-5) +a(n-4) -4*a(n-3) -4*a(n-2) +8*a(n-1) +39*a(n)) /42;
                 a=b;
              end                
            otherwise
                error('Input m Invalid.')
        end        
    otherwise
        error('Input n Invalid.')
end


%滤波结果输出
output_y =a;
end
